In [1]:
import pandas as pd
data={"Name":["john","sam","petter"],
      "Age":[29,24,25],
      "Salary":[30000, 45000,25000]}
df= pd.DataFrame(data)
print(df)

     Name  Age  Salary
0    john   29   30000
1     sam   24   45000
2  petter   25   25000

In [4]:
# read Csv Files 
data=pd.read_csv("C:/Users/Akansha/OneDrive/Desktop/report.csv")
print(data)

    Unnamed: 0 Unnamed: 1                                Unnamed: 2  \
0         Date       Name                                     Today
1   08-08-2022   Akanksha                              I learn HTML
2   09-08-2022   Akanksha                              I learn HTML
3   10-08-2022   Akanksha                               I learn CSS
4   11-08-2022   Akanksha                        I learn Javascript
5   12-08-2022   Akanksha                        I learn javascript
6   13-08-2022   Akanksha                         I learn bootstrap
7   14-08-2022   Akanksha  I attend a online session about database
8   15-08-2022   Akanksha                             I  learn java
9   16-08-2022   Akanksha                   I have create a website
10  17-08-2022   Akanksha                                       NaN
11  18-08-2022   Akanksha                                       NaN
12  19-08-2022   Akanksha                                       NaN
13  20-08-2022   Akanksha                                       NaN

                                               Report
0                                            Tomorrow
1                                  I will learn  HTML
2                                    I will learn CSS
3                             I will learn Javascript
4                             I will learn Javascript
5                              I will learn bootstrap
6       I will attend a online session about database
7                                   I will learn java
8                                   I will learn java
9   I will create one more website by using bootstrap
10                                                NaN
11                                                NaN
12                                                NaN
13                                                NaN

In [7]:
#read excel file 
#for excel file we have installed openpyxl
# data=pd.read_excel("C:/Users/Akansha/OneDrive/Desktop/report.xlsx")
data=pd.read_excel("report.xlsx")
print(data)

             Unnamed: 0 Unnamed: 1                                Unnamed: 2  \
0                  Date       Name                                     Today
1   2022-08-08 00:00:00   Akanksha                              I learn HTML
2   2022-08-09 00:00:00   Akanksha                              I learn HTML
3   2022-08-10 00:00:00   Akanksha                               I learn CSS
4   2022-08-11 00:00:00   Akanksha                        I learn Javascript
5   2022-08-12 00:00:00   Akanksha                        I learn javascript
6   2022-08-13 00:00:00   Akanksha                         I learn bootstrap
7   2022-08-14 00:00:00   Akanksha  I attend a online session about database
8   2022-08-15 00:00:00   Akanksha                             I  learn java
9   2022-08-16 00:00:00   Akanksha                   I have create a website
10  2022-08-17 00:00:00   Akanksha                                       NaN
11  2022-08-18 00:00:00   Akanksha                                       NaN
12  2022-08-19 00:00:00   Akanksha                                       NaN
13  2022-08-20 00:00:00   Akanksha                                       NaN

                                               Report
0                                            Tomorrow
1                                  I will learn  HTML
2                                    I will learn CSS
3                             I will learn Javascript
4                             I will learn Javascript
5                              I will learn bootstrap
6       I will attend a online session about database
7                                   I will learn java
8                                   I will learn java
9   I will create one more website by using bootstrap
10                                                NaN
11                                                NaN
12                                                NaN
13                                                NaN

In [9]:
# Exploring data in pandas 
import pandas as pd
data=pd.read_excel("report.xlsx")
print(data)
print(data.head(10)) #to see all data which we want from long datasetfrom top 
print(data.tail(10))

             Unnamed: 0 Unnamed: 1                                Unnamed: 2  \
0                  Date       Name                                     Today
1   2022-08-08 00:00:00   Akanksha                              I learn HTML
2   2022-08-09 00:00:00   Akanksha                              I learn HTML
3   2022-08-10 00:00:00   Akanksha                               I learn CSS
4   2022-08-11 00:00:00   Akanksha                        I learn Javascript
5   2022-08-12 00:00:00   Akanksha                        I learn javascript
6   2022-08-13 00:00:00   Akanksha                         I learn bootstrap
7   2022-08-14 00:00:00   Akanksha  I attend a online session about database
8   2022-08-15 00:00:00   Akanksha                             I  learn java
9   2022-08-16 00:00:00   Akanksha                   I have create a website
10  2022-08-17 00:00:00   Akanksha                                       NaN
11  2022-08-18 00:00:00   Akanksha                                       NaN
12  2022-08-19 00:00:00   Akanksha                                       NaN
13  2022-08-20 00:00:00   Akanksha                                       NaN

                                               Report
0                                            Tomorrow
1                                  I will learn  HTML
2                                    I will learn CSS
3                             I will learn Javascript
4                             I will learn Javascript
5                              I will learn bootstrap
6       I will attend a online session about database
7                                   I will learn java
8                                   I will learn java
9   I will create one more website by using bootstrap
10                                                NaN
11                                                NaN
12                                                NaN
13                                                NaN
            Unnamed: 0 Unnamed: 1                                Unnamed: 2  \
0                 Date       Name                                     Today
1  2022-08-08 00:00:00   Akanksha                              I learn HTML
2  2022-08-09 00:00:00   Akanksha                              I learn HTML
3  2022-08-10 00:00:00   Akanksha                               I learn CSS
4  2022-08-11 00:00:00   Akanksha                        I learn Javascript
5  2022-08-12 00:00:00   Akanksha                        I learn javascript
6  2022-08-13 00:00:00   Akanksha                         I learn bootstrap
7  2022-08-14 00:00:00   Akanksha  I attend a online session about database
8  2022-08-15 00:00:00   Akanksha                             I  learn java
9  2022-08-16 00:00:00   Akanksha                   I have create a website

                                              Report
0                                           Tomorrow
1                                 I will learn  HTML
2                                   I will learn CSS
3                            I will learn Javascript
4                            I will learn Javascript
5                             I will learn bootstrap
6      I will attend a online session about database
7                                  I will learn java
8                                  I will learn java
9  I will create one more website by using bootstrap
             Unnamed: 0 Unnamed: 1                                Unnamed: 2  \
4   2022-08-11 00:00:00   Akanksha                        I learn Javascript
5   2022-08-12 00:00:00   Akanksha                        I learn javascript
6   2022-08-13 00:00:00   Akanksha                         I learn bootstrap
7   2022-08-14 00:00:00   Akanksha  I attend a online session about database
8   2022-08-15 00:00:00   Akanksha                             I  learn java
9   2022-08-16 00:00:00   Akanksha                   I have create a website
10  2022-08-17 00:00:00   Akanksha                                       NaN
11  2022-08-18 00:00:00   Akanksha                                       NaN
12  2022-08-19 00:00:00   Akanksha                                       NaN
13  2022-08-20 00:00:00   Akanksha                                       NaN

                                               Report
4                             I will learn Javascript
5                              I will learn bootstrap
6       I will attend a online session about database
7                                   I will learn java
8                                   I will learn java
9   I will create one more website by using bootstrap
10                                                NaN
11                                                NaN
12                                                NaN
13                                                NaN

In [12]:
#for information of data
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  14 non-null     object
 1   Unnamed: 1  14 non-null     object
 2   Unnamed: 2  10 non-null     object
 3   Report      10 non-null     object
dtypes: object(4)
memory usage: 576.0+ bytes
None

In [13]:
#describe 
data.describe()

       Unnamed: 0 Unnamed: 1    Unnamed: 2             Report
count          14         14            10                 10
unique         14          2             9                  9
top          Date   Akanksha  I learn HTML  I will learn java
freq            1         13             2                  2

In [14]:
#to see null value
print(data.isnull()) # if null value is there it return true

    Unnamed: 0  Unnamed: 1  Unnamed: 2  Report
0        False       False       False   False
1        False       False       False   False
2        False       False       False   False
3        False       False       False   False
4        False       False       False   False
5        False       False       False   False
6        False       False       False   False
7        False       False       False   False
8        False       False       False   False
9        False       False       False   False
10       False       False        True    True
11       False       False        True    True
12       False       False        True    True
13       False       False        True    True

In [15]:
print(data.isnull().sum()) #total null values

Unnamed: 0    0
Unnamed: 1    0
Unnamed: 2    4
Report        4
dtype: int64

In [16]:
# Handling Duplicate values in pandas 

data=pd.read_excel("Book1.xlsx")
print(data)

    EEID       Name gender   salary
0  EMP01  Akanksha       F  25000.0
1  EMP02     sanket      M  33000.0
2  EMP03        sam      M      NaN
3  EMP04      sarth      M   2000.0
4  EMP05     atharv      M    230.0
5  EMP06     sakshi      F      NaN

In [17]:
print(data.duplicated())

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [18]:
print(data["EEID"].duplicated())

0    False
1    False
2    False
3    False
4    False
5    False
Name: EEID, dtype: bool

In [20]:
print(data["salary"].duplicated().sum()) #do form unique col here
#i have noduplaicate in id so i have done on salary

1

In [22]:
print(data.drop_duplicates("salary"))

    EEID       Name gender   salary
0  EMP01  Akanksha       F  25000.0
1  EMP02     sanket      M  33000.0
2  EMP03        sam      M      NaN
3  EMP04      sarth      M   2000.0
4  EMP05     atharv      M    230.0

In [21]:
#working with missing data in pandas 
import pandas as pd
data=pd.read_excel("Book1.xlsx")
print(data)

    EEID       Name gender   salary
0  EMP01  Akanksha       F  25000.0
1  EMP02     sanket      M  33000.0
2  EMP03        sam      M      NaN
3  EMP04      sarth      M   2000.0
4  EMP05     atharv      M    230.0
5  EMP06     sakshi      F      NaN

In [3]:
print(data.isnull().sum())

EEID      0
Name      0
gender    0
salary    2
dtype: int64

In [4]:
print(data.dropna())

    EEID       Name gender   salary
0  EMP01  Akanksha       F  25000.0
1  EMP02     sanket      M  33000.0
3  EMP04      sarth      M   2000.0
4  EMP05     atharv      M    230.0

In [5]:
#replace null value 
print(data)

    EEID       Name gender   salary
0  EMP01  Akanksha       F  25000.0
1  EMP02     sanket      M  33000.0
2  EMP03        sam      M      NaN
3  EMP04      sarth      M   2000.0
4  EMP05     atharv      M    230.0
5  EMP06     sakshi      F      NaN

In [12]:
import numpy as np
print(data.replace(np.nan,"pending"))

    EEID       Name gender   salary
0  EMP01  Akanksha       F  25000.0
1  EMP02     sanket      M  33000.0
2  EMP03        sam      M  30000.0
3  EMP04      sarth      M   2000.0
4  EMP05     atharv      M    230.0
5  EMP06     sakshi      F  30000.0

In [15]:
import numpy as np
data["salary"]=data["salary"].replace(np.nan,20039)
print(data)

    EEID       Name gender   salary
0  EMP01  Akanksha       F  25000.0
1  EMP02     sanket      M  33000.0
2  EMP03        sam      M  20039.0
3  EMP04      sarth      M   2000.0
4  EMP05     atharv      M    230.0
5  EMP06     sakshi      F  20039.0

In [19]:
print(data["salary"].mean()) 
# add mean value to the null so it cannot 
# affect to the another data and after adding if again we are
# calaculating mean value it remain same

16718.0

In [27]:
#downside value be at  place on null
print(data)
print(data.fillna(method="bfill"))

    EEID       Name gender   salary
0  EMP01  Akanksha       F  25000.0
1  EMP02     sanket      M  33000.0
2  EMP03        sam      M      NaN
3  EMP04      sarth      M   2000.0
4  EMP05     atharv      M    230.0
5  EMP06     sakshi      F      NaN
    EEID       Name gender   salary
0  EMP01  Akanksha       F  25000.0
1  EMP02     sanket      M  33000.0
2  EMP03        sam      M   2000.0
3  EMP04      sarth      M   2000.0
4  EMP05     atharv      M    230.0
5  EMP06     sakshi      F      NaN

C:\Users\Akansha\AppData\Local\Temp\ipykernel_18692\2233846630.py:3: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method="bfill"))

In [28]:
#upper value be at  place on null

print(data.fillna(method="ffill"))

    EEID       Name gender   salary
0  EMP01  Akanksha       F  25000.0
1  EMP02     sanket      M  33000.0
2  EMP03        sam      M  33000.0
3  EMP04      sarth      M   2000.0
4  EMP05     atharv      M    230.0
5  EMP06     sakshi      F    230.0

C:\Users\Akansha\AppData\Local\Temp\ipykernel_18692\3988283792.py:3: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method="ffill"))

In [37]:
# Columns Transformation part_1

df=pd.read_excel("Book1.xlsx")
# print(data)
df.loc[(df["salary"]==0),"GetBonus"]="no bonus"
df.loc[(df["salary"]>0,"GetBonus")]="bonus"
df["GetBonus"]=df["GetBonus"].replace(np.nan,"pending")
print(df)

    EEID       Name gender   salary GetBonus
0  EMP01  Akanksha       F  25000.0    bonus
1  EMP02     sanket      M  33000.0    bonus
2  EMP03        sam      M      NaN  pending
3  EMP04      sarth      M   2000.0    bonus
4  EMP05     atharv      M    230.0    bonus
5  EMP06     sakshi      F      NaN  pending

C:\Users\Akansha\AppData\Local\Temp\ipykernel_18692\4162142884.py:5: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'no bonus' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df.loc[(df["salary"]==0),"GetBonus"]="no bonus"

In [4]:
#Concatenate the columns 
import pandas as dp
data=dp.read_excel("Book1.xlsx")
data["Fullname"]=data["Name"].str.capitalize()+" "+data["gender"]
print(data)

    EEID       Name gender   salary     Fullname
0  EMP01  Akanksha       F  25000.0  Akanksha  F
1  EMP02     sanket      M  33000.0     Sanket M
2  EMP03        sam      M      NaN        Sam M
3  EMP04      sarth      M   2000.0      Sarth M
4  EMP05     atharv      M    230.0     Atharv M
5  EMP06     sakshi      F      NaN     Sakshi F

In [5]:
# Columns Transformation part_2

import pandas as pd
data=dp.read_excel("Book1.xlsx")
data["Bonous"]=(data["salary"]/100)*20
print(data)

    EEID       Name gender   salary  Bonous
0  EMP01  Akanksha       F  25000.0  5000.0
1  EMP02     sanket      M  33000.0  6600.0
2  EMP03        sam      M      NaN     NaN
3  EMP04      sarth      M   2000.0   400.0
4  EMP05     atharv      M    230.0    46.0
5  EMP06     sakshi      F      NaN     NaN

In [7]:
data={"Months":["January","February","March","April"]}
a=pd.DataFrame(data)
print(a)

def extract(value):
    return value[0:3]
a["short_name"]=a["Months"].map(extract)
print(a)

     Months
0   January
1  February
2     March
3     April
     Months short_name
0   January        Jan
1  February        Feb
2     March        Mar
3     April        Apr

In [9]:
#Group by -for summarize the data
import pandas as dp
data=dp.read_excel("Book1.xlsx")
gp=data.groupby("Name").agg({"gender":"count"})
print(gp)

           gender
Name
Akanksha        1
atharv          1
sakshi          1
sam             1
sanket          1
sarth           1

In [2]:
#mergeing and all start form here
import pandas as pd

data1={"Emp Id":["E01","E02","E03","E04","E05","E06"],
      "Names":["Ram","Sam","Shyam","Sanket","Ravi","Jhon"],
      "Age":[23 ,24,23,34,45,34]}

data2={"Emp Id":["E01","E02","E03","E04","E05","E06"],
      "Salary":[23456,234424,34545,345556,44556,78977]}

df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)

print(df1)
print()
print(df2)

  Emp Id   Names  Age
0    E01     Ram   23
1    E02     Sam   24
2    E03   Shyam   23
3    E04  Sanket   34
4    E05    Ravi   45
5    E06    Jhon   34

  Emp Id  Salary
0    E01   23456
1    E02  234424
2    E03   34545
3    E04  345556
4    E05   44556
5    E06   78977

In [19]:
#Merge-any one col must be same 

print(pd.merge(df1,df2))

Empty DataFrame
Columns: [Emp Id, Names, Age]
Index: []

In [8]:
#on basics of something
print(pd.merge(df1,df2,on="Emp Id"))

  Emp Id   Names  Age  Salary
0    E01     Ram   23   23456
1    E02     Sam   24  234424
2    E03   Shyam   23   34545
3    E04  Sanket   34  345556
4    E05    Ravi   45   44556
5    E06    Jhon   34   78977

In [11]:
#Join
print(pd.merge(df1,df2,on="Emp Id",how="inner"))

  Emp Id   Names  Age  Salary
0    E01     Ram   23   23456
1    E02     Sam   24  234424
2    E03   Shyam   23   34545
3    E04  Sanket   34  345556
4    E05    Ravi   45   44556
5    E06    Jhon   34   78977

In [14]:
print(pd.merge(right=df1,left=df2,on="Emp Id",how="left"))

  Emp Id  Salary   Names  Age
0    E01   23456     Ram   23
1    E02  234424     Sam   24
2    E03   34545   Shyam   23
3    E04  345556  Sanket   34
4    E05   44556    Ravi   45
5    E06   78977    Jhon   34

In [16]:
#this join are act like sql joins ,only syntax is different
print(pd.merge(left=df1,right=df2,on="Emp Id",how="right"))

  Emp Id   Names  Age  Salary
0    E01     Ram   23   23456
1    E02     Sam   24  234424
2    E03   Shyam   23   34545
3    E04  Sanket   34  345556
4    E05    Ravi   45   44556
5    E06    Jhon   34   78977

In [21]:
#Concatenate -simailar dataframe is required 
import pandas as pd

data1={"Emp Id":["E01","E02","E03","E04","E05","E06"],
      "Names":["Ram","Sam","Shyam","Sanket","Ravi","Jhon"],
      "Age":[23 ,24,23,34,45,34]}

data2={"Emp Id":["E07","E08","E09","E010","E011","E012"],
      "Names":["Ram1","Sam1","Shyam1","Sanket1","Ravi1","Jhon1"],
      "Age":[23 ,24,23,34,45,34]}

df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)

print(pd.concat([df1,df2]))

  Emp Id    Names  Age
0    E01      Ram   23
1    E02      Sam   24
2    E03    Shyam   23
3    E04   Sanket   34
4    E05     Ravi   45
5    E06     Jhon   34
0    E07     Ram1   23
1    E08     Sam1   24
2    E09   Shyam1   23
3   E010  Sanket1   34
4   E011    Ravi1   45
5   E012    Jhon1   34

*******************Compare Dataframe  *************************

In [26]:
#Compare dataframe 

import pandas as pd
dict={"Fruits":["mango","apple","banana","pappya"],
     "Price":[100,150,50,35],
     "Quantity":[15,10,10,3]}
df=pd.DataFrame(dict)
print(df)
print()
df2=df.copy()


df2.loc[0,"Price"]=120
df2.loc[1,"Price"]=175
df2.loc[3,"Price"]=30
df2.loc[0,"Quantity"]=12
df2.loc[1,"Quantity"]=15
df2.loc[3,"Quantity"]=5
print(df2)

   Fruits  Price  Quantity
0   mango    100        15
1   apple    150        10
2  banana     50        10
3  pappya     35         3

   Fruits  Price  Quantity
0   mango    120        12
1   apple    175        15
2  banana     50        10
3  pappya     30         5

In [29]:
#when similar col are there we can compare

#print(df.compare(df2) )
print(df.compare(df2,align_axis=0))
print(df.compare(df2,keep_shape=True))
#print(df.compare(df2,keep_shape=False))

         Price  Quantity
0 self   100.0      15.0
  other  120.0      12.0
1 self   150.0      10.0
  other  175.0      15.0
3 self    35.0       3.0
  other   30.0       5.0
  Fruits        Price        Quantity
    self other   self  other     self other
0    NaN   NaN  100.0  120.0     15.0  12.0
1    NaN   NaN  150.0  175.0     10.0  15.0
2    NaN   NaN    NaN    NaN      NaN   NaN
3    NaN   NaN   35.0   30.0      3.0   5.0

*************Pivoting and melting dataframe****************************

In [12]:
import pandas as pd

dict={"keys":["k1","k2","k1","k2"],
     "Names":["Jhon","Ben","David","Peter"],
     "Houses":["red","blue","green","red"],
     "Grades":["3rd","8th","9th","8th"]}
df=pd.DataFrame(dict)
print(df)
print(df.pivot(index="keys", columns="Names", values=["Houses","Grades"]))

  keys  Names Houses Grades
0   k1   Jhon    red    3rd
1   k2    Ben   blue    8th
2   k1  David  green    9th
3   k2  Peter    red    8th
      Houses                   Grades
Names    Ben  David Jhon Peter    Ben David Jhon Peter
keys
k1       NaN  green  red   NaN    NaN   9th  3rd   NaN
k2      blue    NaN  NaN   red    8th   NaN  NaN   8th

In [16]:
#Melting
import pandas as pd

dict={"Names":["Jhon","Ben","David","Peter"],
     "Houses":["red","blue","green","red"],
     "Grades":["3rd","8th","9th","8th"]}
df=pd.DataFrame(dict)
print(df)
print(pd.melt(df,id_vars=["Names"],value_vars=["Houses","Grades"]))

   Names Houses Grades
0   Jhon    red    3rd
1    Ben   blue    8th
2  David  green    9th
3  Peter    red    8th
   Names variable  value
0   Jhon   Houses    red
1    Ben   Houses   blue
2  David   Houses  green
3  Peter   Houses    red
4   Jhon   Grades    3rd
5    Ben   Grades    8th
6  David   Grades    9th
7  Peter   Grades    8th